src/test/resources/com/zuora/opg/test/json/stripe_2/ideal/payment/case_01/updatePaymentIntent_response.json

{ "id": "pi_3Pxs1u4ZWiZesCzm1OjRSsaE", "object": "payment_intent", "amount": 1000, "amount_capturable": 0, "amount_details": { "tip": {} }, "amount_received": 1000, "application": "ca_InA7dYYPZTUPuEBolrjvtCzbkivYpfeM", "application_fee_amount": null, "automatic_payment_methods": null, "canceled_at": null, "cancellation_reason": null, "capture_method": "automatic", "charges": { "object": "list", "data": [ { "id": "py_3Pxs1u4ZWiZesCzm18KssLN6", "object": "charge", "amount": 1000, "amount_captured": 1000, "amount_refunded": 0, "application": "ca_InA7dYYPZTUPuEBolrjvtCzbkivYpfeM", "application_fee": null, "application_fee_amount": null, "balance_transaction": "txn_3Pxs1u4ZWiZesCzm1oSM4P5b", "billing_details": { "address": { "city": null, "country": null, "line1": null, "line2": null, "postal_code": null, "state": null }, "email": "abc@xyz.com", "name": "Abhi", "phone": null }, "calculated_statement_descriptor": null, "captured": true, "created": 1726066836, "currency": "eur", "customer": "cus_QpX6xW8AqWsrUr", "description": "Zuora Payment description", "destination": null, "dispute": null, "disputed": false, "failure_balance_transaction": null, "failure_code": null, "failure_message": null, "fraud_details": {}, "invoice": null, "livemode": false, "metadata": {}, "on_behalf_of": null, "order": null, "outcome": { "network_advice_code": null, "network_decline_code": null, "network_status": "approved_by_network", "reason": null, "risk_level": "not_assessed", "seller_message": "Payment complete.", "type": "authorized" }, "paid": true, "payment_intent": "pi_3Pxs1u4ZWiZesCzm1OjRSsaE", "payment_method": "pm_1Pxs1W4ZWiZesCzmiLhpBHPZ", "payment_method_details": { "ideal": { "bank": "rabobank", "bic": "RABONL2U", "generated_sepa_debit": "pm_1Pxs244ZWiZesCzmG3CyQD3l", "generated_sepa_debit_mandate": "mandate_1Pxs244ZWiZesCzmEsqqoDaL", "iban_last4": "5264", "verified_name": "John Smith" }, "type": "ideal" }, "receipt_email": null, "receipt_number": null, "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xMDN5b0k0WldpWmVzQ3ptKJfhhrcGMgbOsZqNquE6LBYvGXjhdJ3w1UkkNpXIcJwwz8Mfkw-jt-Xx_nxCToCRwcAunVdTdH0Psarr", "refunded": false, "refunds": { "object": "list", "data": [], "has_more": false, "total_count": 0, "url": "/v1/charges/py_3Pxs1u4ZWiZesCzm18KssLN6/refunds" }, "review": null, "shipping": null, "source": null, "source_transfer": null, "statement_descriptor": null, "statement_descriptor_suffix": null, "status": "succeeded", "transfer_data": null, "transfer_group": null } ], "has_more": false, "total_count": 1, "url": "/v1/charges?payment_intent=pi_3Pxs1u4ZWiZesCzm1OjRSsaE" }, "client_secret": "pi_3Pxs1u4ZWiZesCzm1OjRSsaE_secret_aS2GkrPixx6qNZpIo1HAoTpp1", "confirmation_method": "automatic", "created": 1726066826, "currency": "eur", "customer": "cus_QpX6xW8AqWsrUr", "description": "Zuora Payment description", "invoice": null, "last_payment_error": null, "latest_charge": "py_3Pxs1u4ZWiZesCzm18KssLN6", "level3": null, "livemode": false, "metadata": { "zpayment_number": "9_P-00000075" }, "next_action": null, "on_behalf_of": null, "payment_method": "pm_1Pxs1W4ZWiZesCzmiLhpBHPZ", "payment_method_configuration_details": null, "payment_method_options": { "ideal": {} }, "payment_method_types": [ "ideal" ], "processing": null, "receipt_email": null, "review": null, "setup_future_usage": "off_session", "shipping": null, "source": null, "statement_descriptor": null, "statement_descriptor_suffix": null, "status": "succeeded", "transfer_data": null, "transfer_group": null }